# CanBeCutWithVoid Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
InstanceVoidCutUtils..::..CanBeCutWithVoid Method
InstanceVoidCutUtils Class See Also
---
Indicates if the element can be cut by an instance with unattached voids.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public static bool CanBeCutWithVoid(
	Element element
)
```

Visual Basic
---
```text
Public Shared Function CanBeCutWithVoid ( _
	element As Element _
) As Boolean
```

Visual C++
---
```text
public:
static bool CanBeCutWithVoid(
	Element^ element
)
```

# ### Parameters
element
    Type: Autodesk.Revit.DB..::..Element The element to be cut
# ### Return Value
Returns true if the element can be cut by an instance with unattached voids.
# Remarks
Elements in a project can be cut if they are host elements or family instances with a category Generic Model or one of the structural categories.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
InstanceVoidCutUtils Class
Autodesk.Revit.DB Namespace